[
    {
        "role": "Machine Learning Engineer",
        "company": "e-Geos S.p.A.",
        "period": "04.2023 – Present",
        "description": "Machine learning and AI solution development for integration into complex, production-grade systems used across international projects. Work at the intersection of model development, data pipeline engineering, and system integration, with a focus on scalability, reliability, and reproducibility.",
        "points": [
            "**End-to-end ML model development** for operational systems, from design and training to containerized deployment and exposure through REST APIs.",
            "**Design and implementation of data pipelines** for retrieval, selection, and preprocessing, now adopted across the department and significantly improving automation and data preparation times.",
            "**Cross-team collaboration** to deliver integrated workflows combining ML, data engineering, and software components into coherent, scalable architectures.",
            "**Mentoring and guidance of a junior ML resource** to support the full development process, accelerate onboarding, and enhance team execution capacity.",
            "**Technical management activities** in international projects, including documentation and alignment of solutions with project requirements."
        ],
        "skills": ["Python", "PyTorch", "TensorFlow", "Scikit-Learn", "Pandas", "Numpy", "MLFlow", "DVC", "FastAPI", "Docker", "Git", "SQL", "Geospatial Tools"]
    },
    {
        "role": "Machine Learning Intern",
        "company": "e-Geos S.p.A.",
        "period": "06.2022 – 04.2023",
        "description": "Contribution to the development of ML solutions and internal tools supporting geospatial data processing and model experimentation.",
        "points": [
            "**Developed and evaluated multiple ML models** for classification and image segmentation on complex geospatial datasets, applying preprocessing and feature extraction techniques to improve performance.",
            "**Deployment of ML prototypes** as reproducible and maintainable tools adopted by the team."
        ],
        "skills": ["Python", "PyTorch", "Pandas", "Numpy", "Git", "Docker", "Geospatial Tools"]

    }
]
